# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs.

# Parameters
nc: 1  # 
scales:  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, MPDF, [128]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, MPDF, [256]]        # 4
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, MPDF, [384]]        # 6
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, MPDF, [384]]        # 8

head:
  # ----- Encoder input proj + AIFI -----
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9  input_proj.2 (P5 -> 256)
  - [-1, 1, AIFI, [1024, 8]]                       # 10 AIFI
  - [-1, 1, Conv, [256, 1, 1]]                     # 11 Y5, lateral_convs.0

  # ----- P5 -> P4  -----
  - [-1, 1, SFR, [None, 2, 'nearest']]             # 12 upsample Y5 to stride 16
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 13 input_proj.1 from P4 (idx 6)
  - [[-2, -1], 1, Concat, [1]]                     # 14 concat [SFR(Y5), P4_proj]
  - [-1, 3, RepC3, [256, 0.5]]                     # 15 FPN block @ P4
  - [-1, 1, Conv, [256, 1, 1]]                     # 16 Y4, lateral_convs.1

  # ----- P4 -> P3 -----
  - [-1, 1, SFR, [None, 2, 'nearest']]             # 17 upsample Y4 to stride 8
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 18 input_proj.0 from P3 (idx 4)
  - [[-2, -1], 1, Concat, [1]]                     # 19 concat [SFR(Y4), P3_proj]
  - [-1, 3, RepC3, [256, 0.5]]                     # 20 X3, fpn_blocks.1 (P3 feature)

  # ----- PAN:  F4 -----
  - [-1, 1, Conv, [256, 3, 2]]                     # 21 downsample_convs.0 (P3 -> P4)
  - [[-1, 16], 1, Concat, [1]]                     # 22 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]                     # 23 F4, pan_blocks.0

  # ----- PAN:  F5 -----
  - [-1, 1, Conv, [256, 3, 2]]                     # 24 downsample_convs.1 (P4 -> P5)
  - [[-1, 11], 1, Concat, [1]]                     # 25 cat Y5  （注意：这里用 11，不是 10）
  - [-1, 3, RepC3, [256, 0.5]]                     # 26 F5, pan_blocks.1

  #：3 个尺度 P3/P4/P5 -----
  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 3, 8, 3]]  # Detect(P3, P4, P5)
